Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ2064DAH176.PIC
      <edc:SFRDef edc:_addr="0x1F8000F0" edc:_begin="0xc8" edc:_end="0x110" edc:_modsrc="DOS-02787_WACB_Config.Module" edc:_refcount="5" edc:access="nnnn--nnnnnnnnnnn--nnnnnnnnnn-n-n" edc:cname="CFGCON2" edc:desc="" edc:impl="0xf0000005" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000--0000000000--0000000000-0-0" edc:name="CFGCON2" edc:nzwidth="32" edc:por="0000--0000000000--0000000000-0-0" edc:portals="- - -" ltx:memberofperipheral="CFG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="GPURESET" edc:mask="0x1" edc:name="GPURESET" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SDWPPOL" edc:mask="0x1" edc:name="SDWPPOL" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SDRDFTHR" edc:desc="" edc:mask="0x3ff" edc:name="SDRDFTHR" edc:nzwidth="10"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="SDWRFTHR" edc:desc="" edc:mask="0x3ff" edc:name="SDWRFTHR" edc:nzwidth="10"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="SDWPEN" edc:desc="" edc:mask="0x1" edc:name="SDWPEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SDCDEN" edc:desc="" edc:mask="0x1" edc:name="SDCDEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GLCDMODE" edc:desc="" edc:mask="0x1" edc:name="GLCDMODE" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="GLCDPINEN" edc:desc="" edc:mask="0x1" edc:name="GLCDPINEN" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800100" edc:_begin="0xc8" edc:_end="0x110" edc:_modsrc="DOS-02787_WACB_Config.Module" edc:_refcount="5" edc:access="rnnnnnnnrn------nnnnnnnn--nnnnnn" edc:cname="CFGMPLL" edc:desc="" edc:impl="0x7f40ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0111111101------111111111111111111" edc:name="CFGMPLL" edc:nzwidth="32" edc:por="0111111101------111111111111111111" edc:portals="- - -" ltx:memberofperipheral="CFG">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="MPLLIDIV" edc:desc="" edc:mask="0x3f" edc:name="MPLLIDIV" edc:nzwidth="6"/>
            <edc:SFRFieldDef edc:cname="INTVREFCON" edc:desc="" edc:mask="0x3" edc:name="INTVREFCON" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="MPLLMULT" edc:desc="" edc:mask="0xff" edc:name="MPLLMULT" edc:nzwidth="8"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="MPLLVREGDIS" edc:desc="" edc:mask="0x1" edc:name="MPLLVREGDIS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="MPLLVREGRDY" edc:desc="" edc:mask="0x1" edc:name="MPLLVREGRDY" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="MPLLODIV1" edc:desc="" edc:mask="0x7" edc:name="MPLLODIV1" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="MPLLODIV2" edc:desc="" edc:mask="0x7" edc:name="MPLLODIV2" edc:nzwidth="3"/>
            <edc:SFRFieldDef edc:cname="MPLLDIS" edc:desc="" edc:mask="0x1" edc:name="MPLLDIS" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="MPLLRDY" edc:desc="" edc:mask="0x1" edc:name="MPLLRDY" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F800110" edc:offset="0x4f0"/>
      <edc:SFRDef edc:_addr="0x1F800600" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02819_pfm_ctrl_32bit_upb_v2.Module" edc:_refcount="1" edc:access="----------------nnnn----nn--nnnn" edc:cname="NVMCON" edc:desc="" edc:grp="NVM" edc:impl="0xfffff7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000----0x--0000" edc:name="NVMCON" edc:nzwidth="0x20" edc:por="----------------0000----0x--0000" edc:portals="CLR SET INV" ltx:baseofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMOP" edc:desc="" edc:mask="0xf" edc:name="NVMOP" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="BFSWAP" edc:mask="0x1" edc:name="BFSWAP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PFSWAP" edc:desc="" edc:mask="0x1" edc:name="PFSWAP" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LVDERR" edc:desc="" edc:mask="0x1" edc:name="LVDERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WRERR" edc:desc="" edc:mask="0x1" edc:name="WRERR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WREN" edc:desc="" edc:mask="0x1" edc:name="WREN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WR" edc:desc="" edc:mask="0x1" edc:name="WR" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="NVMOP0" edc:desc="" edc:mask="0x1" edc:name="NVMOP0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVMOP1" edc:desc="" edc:mask="0x1" edc:name="NVMOP1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVMOP2" edc:desc="" edc:mask="0x1" edc:name="NVMOP2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVMOP3" edc:desc="" edc:mask="0x1" edc:name="NVMOP3" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="SWAP" edc:mask="0x1" edc:name="SWAP" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="PROGOP" edc:desc="" edc:mask="0x1" edc:name="PROGOP" edc:nzwidth="0x4"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:SFRFieldDef edc:cname="PROGOP0" edc:desc="" edc:mask="0x1" edc:name="PROGOP0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PROGOP1" edc:desc="" edc:mask="0x1" edc:name="PROGOP1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PROGOP2" edc:desc="" edc:mask="0x1" edc:name="PROGOP2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PROGOP3" edc:desc="" edc:mask="0x1" edc:name="PROGOP3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.3">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F800610" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-02819_pfm_ctrl_32bit_upb_v2.Module" edc:_refcount="1" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="NVMKEY" edc:desc="" edc:grp="FLASH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="NVMKEY" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="- - -" ltx:memberofperipheral="NVM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="NVMKEY" edc:desc="" edc:islanghidden="true" edc:mask="0xffffffff" edc:name="NVMKEY" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
