Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ2064DAH176.PIC
      <edc:SFRDef edc:_addr="0x1F8C02B0" edc:_begin="0x24" edc:_end="0x28" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="30" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR29" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR29" edc:nzwidth="32" edc:por="00000000000000000000000000000000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8C02B4" edc:_begin="0x24" edc:_end="0x28" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="31" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR30" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR30" edc:nzwidth="32" edc:por="00000000000000000000000000000000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8C02B8" edc:_begin="0x24" edc:_end="0x28" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="32" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR31" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR31" edc:nzwidth="32" edc:por="00000000000000000000000000000000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8C02BC" edc:_begin="0x24" edc:_end="0x28" edc:_modsrc="DOS-01475_lpwr_deep_sleep_ctrl_v2.Module" edc:_refcount="33" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="DSGPR32" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="DSGPR32" edc:nzwidth="32" edc:por="00000000000000000000000000000000">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DSGPR" edc:desc="" edc:mask="0xffffffff" edc:name="DSGPR" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0x1f8e0000" edc:endaddr="0x1f8ed000" edc:kseg1="0xa0000000" edc:regionid="periph_indep">
      <edc:SFRDef edc:_addr="0x1F8E0000" edc:_begin="0x0" edc:_end="0x20" edc:_modsrc="DOS-01643_pfm_cache_ahb_v2.Module" edc:_refcount="1" edc:access="-----n--------------------nn-nnn" edc:cname="PRECON" edc:desc="" edc:impl="0x4000037" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----0--------------------00-111" edc:name="PRECON" edc:nzwidth="32" edc:por="-----0--------------------00-111" edc:portals="CLR SET INV" ltx:baseofperipheral="PCACHE">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PFMWS" edc:desc="" edc:mask="0x7" edc:name="PFMWS" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PREFEN" edc:desc="" edc:mask="0x3" edc:name="PREFEN" edc:nzwidth="2"/>
            <edc:AdjustPoint edc:offset="20"/>
            <edc:SFRFieldDef edc:cname="PFMSECEN" edc:desc="" edc:mask="0x1" edc:name="PFMSECEN" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E0010" edc:_begin="0x0" edc:_end="0x20" edc:_modsrc="DOS-01643_pfm_cache_ahb_v2.Module" edc:_refcount="1" edc:access="----nn------------------nnnnnnnn" edc:cname="PRESTAT" edc:desc="" edc:impl="0xc0000ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----00------------------00000000" edc:name="PRESTAT" edc:nzwidth="32" edc:por="----00------------------00000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PCACHE">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PFMSECCNT" edc:desc="" edc:mask="0xff" edc:name="PFMSECCNT" edc:nzwidth="8"/>
            <edc:AdjustPoint edc:offset="18"/>
            <edc:SFRFieldDef edc:cname="PFMSEC" edc:desc="" edc:mask="0x1" edc:name="PFMSEC" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PFMDED" edc:desc="" edc:mask="0x1" edc:name="PFMDED" edc:nzwidth="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8E0020" edc:offset="0xFF4"/>
      <edc:SFRDef edc:_addr="0x1F8E1014" edc:_begin="0x0" edc:_end="0x10" edc:_modsrc="DOS-EIP-00109_ebi_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnn----------------" edc:cname="EBICS0" edc:desc="" edc:impl="0xffff0000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000----------------" edc:name="EBICS0" edc:nzwidth="32" edc:por="0000000000000000----------------" ltx:baseofperipheral="EBI">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="16"/>
            <edc:SFRFieldDef edc:cname="CSADDR" edc:desc="" edc:mask="0xffff" edc:name="CSADDR" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E1018" edc:_begin="0x0" edc:_end="0x10" edc:_modsrc="DOS-EIP-00109_ebi_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnn----------------" edc:cname="EBICS1" edc:desc="" edc:impl="0xffff0000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000----------------" edc:name="EBICS1" edc:nzwidth="32" edc:por="0000000000000000----------------" ltx:memberofperipheral="EBI">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="16"/>
            <edc:SFRFieldDef edc:cname="CSADDR" edc:desc="" edc:mask="0xffff" edc:name="CSADDR" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E101C" edc:_begin="0x0" edc:_end="0x10" edc:_modsrc="DOS-EIP-00109_ebi_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnn----------------" edc:cname="EBICS2" edc:desc="" edc:impl="0xffff0000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000----------------" edc:name="EBICS2" edc:nzwidth="32" edc:por="0000000000000000----------------" ltx:memberofperipheral="EBI">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="16"/>
            <edc:SFRFieldDef edc:cname="CSADDR" edc:desc="" edc:mask="0xffff" edc:name="CSADDR" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8E1020" edc:_begin="0x0" edc:_end="0x10" edc:_modsrc="DOS-EIP-00109_ebi_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnn----------------" edc:cname="EBICS3" edc:desc="" edc:impl="0xffff0000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000----------------" edc:name="EBICS3" edc:nzwidth="32" edc:por="0000000000000000----------------" ltx:memberofperipheral="EBI">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="16"/>
            <edc:SFRFieldDef edc:cname="CSADDR" edc:desc="" edc:mask="0xffff" edc:name="CSADDR" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
