Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/edc/PIC32MZ2064DAH176.PIC
      <edc:SFRDef edc:_addr="0x1F8EA890" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA36" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA36" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL97" edc:desc="" edc:mask="0xf" edc:name="PIXEL97" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL96" edc:desc="" edc:mask="0xf" edc:name="PIXEL96" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL95" edc:desc="" edc:mask="0xf" edc:name="PIXEL95" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL94" edc:desc="" edc:mask="0xf" edc:name="PIXEL94" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL93" edc:desc="" edc:mask="0xf" edc:name="PIXEL93" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL92" edc:desc="" edc:mask="0xf" edc:name="PIXEL92" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL91" edc:desc="" edc:mask="0xf" edc:name="PIXEL91" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL90" edc:desc="" edc:mask="0xf" edc:name="PIXEL90" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA894" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA37" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA37" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL915" edc:desc="" edc:mask="0xf" edc:name="PIXEL915" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL914" edc:desc="" edc:mask="0xf" edc:name="PIXEL914" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL913" edc:desc="" edc:mask="0xf" edc:name="PIXEL913" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL912" edc:desc="" edc:mask="0xf" edc:name="PIXEL912" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL911" edc:desc="" edc:mask="0xf" edc:name="PIXEL911" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL910" edc:desc="" edc:mask="0xf" edc:name="PIXEL910" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL99" edc:desc="" edc:mask="0xf" edc:name="PIXEL79" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL98" edc:desc="" edc:mask="0xf" edc:name="PIXEL78" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA898" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA38" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA38" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL923" edc:desc="" edc:mask="0xf" edc:name="PIXEL923" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL922" edc:desc="" edc:mask="0xf" edc:name="PIXEL922" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL921" edc:desc="" edc:mask="0xf" edc:name="PIXEL921" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL920" edc:desc="" edc:mask="0xf" edc:name="PIXEL920" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL919" edc:desc="" edc:mask="0xf" edc:name="PIXEL919" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL918" edc:desc="" edc:mask="0xf" edc:name="PIXEL918" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL917" edc:desc="" edc:mask="0xf" edc:name="PIXEL917" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL916" edc:desc="" edc:mask="0xf" edc:name="PIXEL916" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA89C" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA39" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA39" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL931" edc:desc="" edc:mask="0xf" edc:name="PIXEL931" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL930" edc:desc="" edc:mask="0xf" edc:name="PIXEL930" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL929" edc:desc="" edc:mask="0xf" edc:name="PIXEL929" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL928" edc:desc="" edc:mask="0xf" edc:name="PIXEL928" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL927" edc:desc="" edc:mask="0xf" edc:name="PIXEL927" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL926" edc:desc="" edc:mask="0xf" edc:name="PIXEL926" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL925" edc:desc="" edc:mask="0xf" edc:name="PIXEL925" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL924" edc:desc="" edc:mask="0xf" edc:name="PIXEL924" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
